In [1]:
import pandas as pd
import csv
from datetime import datetime

In [2]:
# The path to our CSV file
file = "Resources/daily_area.csv.txt"

# Read our purchase data into pandas
df = pd.read_csv(file,delim_whitespace=True)

df.rename(columns={"YYYY": "Year", "MM": "Month", "DD":"Day"},inplace = True)
df.head()

   Year  Month  Day  Total  North  South
0  1874      5    1   -1.0   -1.0   -1.0
1  1874      5    2   -1.0   -1.0   -1.0
2  1874      5    3   -1.0   -1.0   -1.0
3  1874      5    4   -1.0   -1.0   -1.0
4  1874      5    5   -1.0   -1.0   -1.0

In [3]:
# Remove row with missing readings (represented as -1)
df = df.loc[df['Total'] != '-1.0'].reset_index(drop=True)
df.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops.py:1649: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

   Year  Month  Day  Total  North  South
0  1874      5    1   -1.0   -1.0   -1.0
1  1874      5    2   -1.0   -1.0   -1.0
2  1874      5    3   -1.0   -1.0   -1.0
3  1874      5    4   -1.0   -1.0   -1.0
4  1874      5    5   -1.0   -1.0   -1.0

In [4]:
sunspots= df.loc[df["Year"] > 2013, [
    "Year", "Month", "Day","Total","North","South"]]
sunspots.head()

       Year  Month  Day   Total  North   South
51014  2014      1    1   686.0   28.0   658.0
51015  2014      1    2   854.0   28.0   826.0
51016  2014      1    3  1974.0   56.0  1918.0
51017  2014      1    4  2198.0   56.0  2142.0
51018  2014      1    5  2394.0   70.0  2324.0

In [5]:
#sunspots.set_index(["Year"], inplace = True, 
                    #append = True, drop = True) 
#sunspots.head()

In [6]:
sunspots.to_csv("output/sunspot_2014_19.csv")

In [7]:
months = []
for i,row in sunspots.iterrows():
    months.append(datetime(int(row['Year']),int(row['Month']), 1).strftime("%Y-%m-%d"))

In [8]:
unique_months = {}
for month in months:
    if month not in unique_months.keys():
        unique_months[month]=0
print(unique_months)

{'2014-01-01': 0, '2014-02-01': 0, '2014-03-01': 0, '2014-04-01': 0, '2014-05-01': 0, '2014-06-01': 0, '2014-07-01': 0, '2014-08-01': 0, '2014-09-01': 0, '2014-10-01': 0, '2014-11-01': 0, '2014-12-01': 0, '2015-01-01': 0, '2015-02-01': 0, '2015-03-01': 0, '2015-04-01': 0, '2015-05-01': 0, '2015-06-01': 0, '2015-07-01': 0, '2015-08-01': 0, '2015-09-01': 0, '2015-10-01': 0, '2015-11-01': 0, '2015-12-01': 0, '2016-01-01': 0, '2016-02-01': 0, '2016-03-01': 0, '2016-04-01': 0, '2016-05-01': 0, '2016-06-01': 0, '2016-07-01': 0, '2016-08-01': 0, '2016-09-01': 0, '2016-10-01': 0, '2016-11-01': 0, '2016-12-01': 0, '2017-01-01': 0, '2017-02-01': 0, '2017-03-01': 0, '2017-04-01': 0, '2017-05-01': 0, '2017-06-01': 0, '2017-07-01': 0, '2017-08-01': 0, '2017-09-01': 0, '2017-10-01': 0, '2017-11-01': 0, '2017-12-01': 0, '2018-01-01': 0, '2018-02-01': 0, '2018-03-01': 0, '2018-04-01': 0, '2018-05-01': 0, '2018-06-01': 0, '2018-07-01': 0, '2018-08-01': 0, '2018-09-01': 0, '2018-10-01': 0, '2018-11-01': 0, '2018-12-01': 0, '2019-01-01': 0, '2019-02-01': 0, '2019-03-01': 0, '2019-04-01': 0, '2019-05-01': 0, '2019-06-01': 0, '2019-07-01': 0, '2019-08-01': 0}

In [9]:
count = []
for month in unique_months:
    count.append(months.count(month))
print(count)

[31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31, 31, 28, 31, 30, 31, 30, 31, 31]

In [10]:
for i, row in sunspots.iterrows():
    unique_months[datetime(int(row['Year']),int(row['Month']), 1).strftime("%Y-%m-%d")] = unique_months[datetime(int(row['Year']),int(row['Month']), 1).strftime("%Y-%m-%d")] + row['Total']
print(unique_months)

{'2014-01-01': 46473.0, '2014-02-01': 56427.0, '2014-03-01': 31822.0, '2014-04-01': 33628.0, '2014-05-01': 29470.0, '2014-06-01': 25928.0, '2014-07-01': 37366.0, '2014-08-01': 24528.0, '2014-09-01': 33376.0, '2014-10-01': 54782.0, '2014-11-01': 36568.0, '2014-12-01': 44646.0, '2015-01-01': 29974.0, '2015-02-01': 15484.0, '2015-03-01': 15897.0, '2015-04-01': 21098.0, '2015-05-01': 19376.0, '2015-06-01': 25214.0, '2015-07-01': 15960.0, '2015-08-01': 22191.4, '2015-09-01': 17808.0, '2015-10-01': 14406.0, '2015-11-01': 11914.0, '2015-12-01': 17640.0, '2016-01-01': 11368.0, '2016-02-01': 11074.0, '2016-03-01': 9184.0, '2016-04-01': 16996.0, '2016-05-01': 15582.0, '2016-06-01': 6622.0, '2016-07-01': 10374.0, '2016-08-01': 8764.0, '2016-09-01': 10969.0, '2016-10-01': 9044.0, '2016-11-01': 2884.0, '2016-12-01': 3038.0, '2017-01-01': 5432.0, '2017-02-01': 2884.0, '2017-03-01': 3024.0, '2017-04-01': 10458.0, '2017-05-01': 2340.8, '2017-06-01': 4158.0, '2017-07-01': 8225.0, '2017-08-01': 10738.0, '2017-09-01': 24920.0, '2017-10-01': 5180.0, '2017-11-01': 798.0, '2017-12-01': 966.0, '2018-01-01': 266.0, '2018-02-01': 3066.0, '2018-03-01': 84.0, '2018-04-01': 840.0, '2018-05-01': 1050.0, '2018-06-01': 1890.0, '2018-07-01': 14.0, '2018-08-01': 658.0, '2018-09-01': 56.0, '2018-10-01': 238.0, '2018-11-01': 336.0, '2018-12-01': 140.0, '2019-01-01': 1036.0, '2019-02-01': 0.0, '2019-03-01': 1666.0, '2019-04-01': 5600.0, '2019-05-01': 5390.0, '2019-06-01': 56.0, '2019-07-01': 28.0, '2019-08-01': 14.0}

In [21]:
sunspot_new=pd.DataFrame.from_dict(unique_months,orient='index')
    
sunspot_new.head()

                  0
2014-01-01  46473.0
2014-02-01  56427.0
2014-03-01  31822.0
2014-04-01  33628.0
2014-05-01  29470.0

In [22]:
sunspot_new.columns = ['Total']
sunspot_new.head()

              Total
2014-01-01  46473.0
2014-02-01  56427.0
2014-03-01  31822.0
2014-04-01  33628.0
2014-05-01  29470.0

In [23]:
 sunspot_new.reset_index(inplace=True)

In [24]:
sunspot_new.rename(columns={"index": "Date"},inplace=True)
sunspot_new.head()

         Date    Total
0  2014-01-01  46473.0
1  2014-02-01  56427.0
2  2014-03-01  31822.0
3  2014-04-01  33628.0
4  2014-05-01  29470.0